IDEA Open Model
CrossSectionFactory.FillWeldedI Method
Compatible with IDEA StatiCa 20.1
 Fill steel section of welded I
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillWeldedI(
	CrossSectionParameter css,
	double bu,
	double hw,
	double tw,
	double tf
)
Public Shared Sub FillWeldedI (
	css As CrossSectionParameter,
	bu As Double,
	hw As Double,
	tw As Double,
	tf As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu
Type: System.Double
Width of flange
hw
Type: System.Double
Height of web
tw
Type: System.Double
Web thickness
tf
Type: System.Double
Flange thickness
Remarks
Dimension of welded I section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 1;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());  // I have only one material, I take the first one
double bu = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf = 0.02;
CrossSectionFactory.FillWeldedI(css, bu, hw, tw, tf);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace